RT-Thread/rt-thread/bsp/efm32/Libraries/CMSIS/CM3/DeviceSupport/EnergyMicro/EFM32/efm32lg332f256.h
/* Bit fields for USB PCGCCTL */
#define _USB_PCGCCTL_RESETVALUE                    0x00000000UL                               /**< Default value for USB_PCGCCTL */
#define _USB_PCGCCTL_MASK                          0x000001CFUL                               /**< Mask for USB_PCGCCTL */
#define USB_PCGCCTL_STOPPCLK                       (0x1UL << 0)                               /**< Stop PHY clock */
#define _USB_PCGCCTL_STOPPCLK_SHIFT                0                                          /**< Shift value for USB_STOPPCLK */
#define _USB_PCGCCTL_STOPPCLK_MASK                 0x1UL                                      /**< Bit mask for USB_STOPPCLK */
#define _USB_PCGCCTL_STOPPCLK_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_STOPPCLK_DEFAULT               (_USB_PCGCCTL_STOPPCLK_DEFAULT << 0)       /**< Shifted mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_GATEHCLK                       (0x1UL << 1)                               /**< Gate HCLK */
#define _USB_PCGCCTL_GATEHCLK_SHIFT                1                                          /**< Shift value for USB_GATEHCLK */
#define _USB_PCGCCTL_GATEHCLK_MASK                 0x2UL                                      /**< Bit mask for USB_GATEHCLK */
#define _USB_PCGCCTL_GATEHCLK_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_GATEHCLK_DEFAULT               (_USB_PCGCCTL_GATEHCLK_DEFAULT << 1)       /**< Shifted mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_PWRCLMP                        (0x1UL << 2)                               /**< Power Clamp */
#define _USB_PCGCCTL_PWRCLMP_SHIFT                 2                                          /**< Shift value for USB_PWRCLMP */
#define _USB_PCGCCTL_PWRCLMP_MASK                  0x4UL                                      /**< Bit mask for USB_PWRCLMP */
#define _USB_PCGCCTL_PWRCLMP_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_PWRCLMP_DEFAULT                (_USB_PCGCCTL_PWRCLMP_DEFAULT << 2)        /**< Shifted mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_RSTPDWNMODULE                  (0x1UL << 3)                               /**< Reset Power-Down Modules */
#define _USB_PCGCCTL_RSTPDWNMODULE_SHIFT           3                                          /**< Shift value for USB_RSTPDWNMODULE */
#define _USB_PCGCCTL_RSTPDWNMODULE_MASK            0x8UL                                      /**< Bit mask for USB_RSTPDWNMODULE */
#define _USB_PCGCCTL_RSTPDWNMODULE_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_RSTPDWNMODULE_DEFAULT          (_USB_PCGCCTL_RSTPDWNMODULE_DEFAULT << 3)  /**< Shifted mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_PHYSLEEP                       (0x1UL << 6)                               /**< PHY In Sleep */
#define _USB_PCGCCTL_PHYSLEEP_SHIFT                6                                          /**< Shift value for USB_PHYSLEEP */
#define _USB_PCGCCTL_PHYSLEEP_MASK                 0x40UL                                     /**< Bit mask for USB_PHYSLEEP */
#define _USB_PCGCCTL_PHYSLEEP_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_PHYSLEEP_DEFAULT               (_USB_PCGCCTL_PHYSLEEP_DEFAULT << 6)       /**< Shifted mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_RESETAFTERSUSP                 (0x1UL << 8)                               /**< Reset after suspend */
#define _USB_PCGCCTL_RESETAFTERSUSP_SHIFT          8                                          /**< Shift value for USB_RESETAFTERSUSP */
#define _USB_PCGCCTL_RESETAFTERSUSP_MASK           0x100UL                                    /**< Bit mask for USB_RESETAFTERSUSP */
#define _USB_PCGCCTL_RESETAFTERSUSP_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_RESETAFTERSUSP_DEFAULT         (_USB_PCGCCTL_RESETAFTERSUSP_DEFAULT << 8) /**< Shifted mode DEFAULT for USB_PCGCCTL */

/* Bit fields for USB FIFO0D_FIFO0D */
#define _USB_FIFO0D_FIFO0D_RESETVALUE              0x00000000UL                             /**< Default value for USB_FIFO0D_FIFO0D */
#define _USB_FIFO0D_FIFO0D_MASK                    0xFFFFFFFFUL                             /**< Mask for USB_FIFO0D_FIFO0D */
#define _USB_FIFO0D_FIFO0D_FIFO0D_SHIFT            0                                        /**< Shift value for USB_FIFO0D */
#define _USB_FIFO0D_FIFO0D_FIFO0D_MASK             0xFFFFFFFFUL                             /**< Bit mask for USB_FIFO0D */
#define _USB_FIFO0D_FIFO0D_FIFO0D_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for USB_FIFO0D_FIFO0D */
#define USB_FIFO0D_FIFO0D_FIFO0D_DEFAULT           (_USB_FIFO0D_FIFO0D_FIFO0D_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_FIFO0D_FIFO0D */

/* Bit fields for USB FIFO1D_FIFO1D */
#define _USB_FIFO1D_FIFO1D_RESETVALUE              0x00000000UL                             /**< Default value for USB_FIFO1D_FIFO1D */
#define _USB_FIFO1D_FIFO1D_MASK                    0xFFFFFFFFUL                             /**< Mask for USB_FIFO1D_FIFO1D */
#define _USB_FIFO1D_FIFO1D_FIFO1D_SHIFT            0                                        /**< Shift value for USB_FIFO1D */
#define _USB_FIFO1D_FIFO1D_FIFO1D_MASK             0xFFFFFFFFUL                             /**< Bit mask for USB_FIFO1D */
#define _USB_FIFO1D_FIFO1D_FIFO1D_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for USB_FIFO1D_FIFO1D */
#define USB_FIFO1D_FIFO1D_FIFO1D_DEFAULT           (_USB_FIFO1D_FIFO1D_FIFO1D_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_FIFO1D_FIFO1D */

/* Bit fields for USB FIFO2D_FIFO2D */
#define _USB_FIFO2D_FIFO2D_RESETVALUE              0x00000000UL                             /**< Default value for USB_FIFO2D_FIFO2D */
#define _USB_FIFO2D_FIFO2D_MASK                    0xFFFFFFFFUL                             /**< Mask for USB_FIFO2D_FIFO2D */
#define _USB_FIFO2D_FIFO2D_FIFO2D_SHIFT            0                                        /**< Shift value for USB_FIFO2D */
#define _USB_FIFO2D_FIFO2D_FIFO2D_MASK             0xFFFFFFFFUL                             /**< Bit mask for USB_FIFO2D */
#define _USB_FIFO2D_FIFO2D_FIFO2D_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for USB_FIFO2D_FIFO2D */
#define USB_FIFO2D_FIFO2D_FIFO2D_DEFAULT           (_USB_FIFO2D_FIFO2D_FIFO2D_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_FIFO2D_FIFO2D */

/* Bit fields for USB FIFO3D_FIFO3D */
#define _USB_FIFO3D_FIFO3D_RESETVALUE              0x00000000UL                             /**< Default value for USB_FIFO3D_FIFO3D */
#define _USB_FIFO3D_FIFO3D_MASK                    0xFFFFFFFFUL                             /**< Mask for USB_FIFO3D_FIFO3D */
#define _USB_FIFO3D_FIFO3D_FIFO3D_SHIFT            0                                        /**< Shift value for USB_FIFO3D */
#define _USB_FIFO3D_FIFO3D_FIFO3D_MASK             0xFFFFFFFFUL                             /**< Bit mask for USB_FIFO3D */
#define _USB_FIFO3D_FIFO3D_FIFO3D_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for USB_FIFO3D_FIFO3D */
#define USB_FIFO3D_FIFO3D_FIFO3D_DEFAULT           (_USB_FIFO3D_FIFO3D_FIFO3D_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_FIFO3D_FIFO3D */

